function trans() {
	var str = document.getElementById("deviz");
	str.innerText = '"Швидше, вище, сильніше"';
}
function trans2() {
	var str = document.getElementById("deviz");
	str.innerText = '"Citius, altius, fortius"';
}

function rest() {
	document.frm.olymp.value = "";
	document.frm.champ.value = "";
	var sp = document.getElementById('sport');
	// alert(sp.options.length);
	for(let i=sp.options.length-1; i>-1; i--) {
		sp.options[i].remove();
	}
	opys.innerHTML = "&nbsp;";
}

function change() {
	var year = document.frm.olymp.value;
	var rik = document.getElementById('rik');
	
	k = -1; 
	var n = rik.options.length;
	
	for(let i=0; i<n; i++) {
		if(year == rik.options[i].value) {
			k = i; break;
		}
	}
	
	var sp = document.getElementById('sport');
	for(let i=sp.options.length-1; i>-1; i--){
		sp.options[i].remove();
	}

	var sports = [["Браславець Євген","Кличко Володимир","Кравець Інеса","Матвієнко Ігор","Олейник В'ячеслав","Подкопаєва Лілія","Серебрянська Катерина","Таймазов Тимур","Шаріпов Рустам"],
				["Клочкова Яна","Мільчев Микола"],
				["Гончаров Валерій","Клочкова Яна","Костевич Олена","Мерлені Ірина","Нікітін Юрій","Скакун Наталія","Тедеєв Ельбрус"],
				['Айвазян Артур','Добринська Наталя','Жовнір Ольга','Ломаченко Василь','Осипенко-Радомська Інна','Петрів Олександр','Пундик Галина','Рубан Віктор','Харлан Ольга','Хомрова Олена'],
				['Дементьєва Яна','Довгодько Наталія','Коженкова Анастасія','Ломаченко Василь','Тарасенко Катерина','Торохтій Олексій','Усик Олександр','Чебан Юрій','Шемякіна Яна'],
				['Верняєв Олег','Чебан Юрій']];

	document.frm.champ.value = "";
	if(k>-1) {
		m=sports[k].length
		for(let i=0; i<m; i++){
			let op = document.createElement('option');
	  		op.innerHTML = sports[k][i];
	  		sp.append(op);
		}
	}
}

function show() {
	var games = ['XXVI Олімпійські ігри. Атланта','XXVII Олімпійські ігри. Сідней','XXVIII Олімпійські ігри. Афіни','XXIX Олімпійські ігри. Пекін','XXX Олімпійські ігри. Лондон','XXXI Олімпійські ігри. Ріо-де-Жанейро'];
	var vid = [['вітрильний спорт','бокс (понад 91 кг)','легка атлетика (потрійний стрибок)','вітрильний спорт','греко-римська боротьба (90 кг)','спортивна гімнастика (абсолютна першість, вільні вправи)','художня гімнастика','важка атлетика (до 100 кг)','спортивна гімнастика (вправи на брусах)'],
				['плавання (200 м і 400 м, комплексне плавання)','стрільба стендова'],
				['спортивна гімнастика (вправи на брусах)','плавання (200 м і 400 м, комплексне плавання)','стрільба кульова (пневматичний пістолет)','боротьба вільна (48 кг)','стрибки на батуті','важка атлетика (до 63 кг)','боротьба вільна (66 кг)'],
				['кульова стрільба','легка атлетика, семиборство','фехтування, шабля, командні змагання','бокс','веслування, байдарка','кульова стрільба','стрільба з лука','фехтування, шабля, командні змагання','фехтування, шабля, командні змагання','фехтування, шабля, командні змагання'],
				['академічне веслування, четвірка парна','академічне веслування, четвірка парна','академічне веслування, четвірка парна','бокс','академічне веслування, четвірка парна','важка атлетика, до 105 кг','бокс','веслування на байдарках і каное, каное-одиночка, 200 м','фехтування, шпага, індивідуальні змагання'],
				['спортивна гімнастика (вправи на брусах)','веслування на байдарках і каное, каное-одиночка, 200 м']];

	k = -1; 
	var year = document.frm.olymp.value;
	var rik = document.getElementById('rik');
	n = rik.options.length;
	for(let i=0; i<n; i++) {
		if(year == rik.options[i].value) {
			k = i; break;
		}
	}
	
	t = -1;
	var nam = document.frm.champ.value;
	var sp = document.getElementById('sport');
	n = sp.options.length;
	for(let i=0; i<n; i++) {
		if(nam == sp.options[i].value) {
			t = i; break;
		}
	}

	if (k>-1 && t>-1) {
		str = year + " рік. " + games[k] + ". " + nam + " - " + vid[k][t];
		opys.innerText = str;
	}
	else
		if (k>-1 && nam=="") opys.innerText = "Уведіть прізвище спортсмена";
		else
			if (k>-1) opys.innerText = "Такого чемпіона з України на цій олімпіаді не було";
			else 
				if (year=="") opys.innerText = "Уведіть рік олімпіади";
				else opys.innerText = "У цей рік літньої олімпіади з участю команди України не було";


}